JayHeng/RT-MFB/boards/mcu/mfb_fw/imxrt685/port_mixspi_info.h
        const uint32_t port1_pin12_config = (/* Pin is configured as FLEXSPI0B_DATA1 */
                                             IOPCTL_PIO_FUNC6 |
                                             /* Disable pull-up / pull-down function */
                                             IOPCTL_PIO_PUPD_DI |
                                             /* Enable pull-down function */
                                             IOPCTL_PIO_PULLDOWN_EN |
                                             /* Enables input buffer function */
                                             IOPCTL_PIO_INBUF_EN |
                                             /* Normal mode */
                                             IOPCTL_PIO_SLEW_RATE_NORMAL |
                                             /* Full drive enable */
                                             IOPCTL_PIO_FULLDRIVE_EN |
                                             /* Analog mux is disabled */
                                             IOPCTL_PIO_ANAMUX_DI |
                                             /* Pseudo Output Drain is disabled */
                                             IOPCTL_PIO_PSEDRAIN_DI |
                                             /* Input function is not inverted */
                                             IOPCTL_PIO_INV_DI);
        /* PORT1 PIN12 (coords: M2) is configured as FLEXSPI0B_DATA1 */
        IOPCTL_PinMuxSet(IOPCTL, 1U, 12U, port1_pin12_config);

        const uint32_t port1_pin13_config = (/* Pin is configured as FLEXSPI0B_DATA2 */
                                             IOPCTL_PIO_FUNC6 |
                                             /* Disable pull-up / pull-down function */
                                             IOPCTL_PIO_PUPD_DI |
                                             /* Enable pull-down function */
                                             IOPCTL_PIO_PULLDOWN_EN |
                                             /* Enables input buffer function */
                                             IOPCTL_PIO_INBUF_EN |
                                             /* Normal mode */
                                             IOPCTL_PIO_SLEW_RATE_NORMAL |
                                             /* Full drive enable */
                                             IOPCTL_PIO_FULLDRIVE_EN |
                                             /* Analog mux is disabled */
                                             IOPCTL_PIO_ANAMUX_DI |
                                             /* Pseudo Output Drain is disabled */
                                             IOPCTL_PIO_PSEDRAIN_DI |
                                             /* Input function is not inverted */
                                             IOPCTL_PIO_INV_DI);
        /* PORT1 PIN13 (coords: N1) is configured as FLEXSPI0B_DATA2 */
        IOPCTL_PinMuxSet(IOPCTL, 1U, 13U, port1_pin13_config);

        const uint32_t port1_pin14_config = (/* Pin is configured as FLEXSPI0B_DATA3 */
                                             IOPCTL_PIO_FUNC6 |
                                             /* Disable pull-up / pull-down function */
                                             IOPCTL_PIO_PUPD_DI |
                                             /* Enable pull-down function */
                                             IOPCTL_PIO_PULLDOWN_EN |
                                             /* Enables input buffer function */
                                             IOPCTL_PIO_INBUF_EN |
                                             /* Normal mode */
                                             IOPCTL_PIO_SLEW_RATE_NORMAL |
                                             /* Full drive enable */
                                             IOPCTL_PIO_FULLDRIVE_EN |
                                             /* Analog mux is disabled */
                                             IOPCTL_PIO_ANAMUX_DI |
                                             /* Pseudo Output Drain is disabled */
                                             IOPCTL_PIO_PSEDRAIN_DI |
                                             /* Input function is not inverted */
                                             IOPCTL_PIO_INV_DI);
        /* PORT1 PIN14 (coords: N2) is configured as FLEXSPI0B_DATA3 */
        IOPCTL_PinMuxSet(IOPCTL, 1U, 14U, port1_pin14_config);

        const uint32_t port1_pin29_config = (/* Pin is configured as FLEXSPI0B_SCLK */
                                             IOPCTL_PIO_FUNC5 |
                                             /* Disable pull-up / pull-down function */
                                             IOPCTL_PIO_PUPD_DI |
                                             /* Enable pull-down function */
                                             IOPCTL_PIO_PULLDOWN_EN |
                                             /* Enables input buffer function */
                                             IOPCTL_PIO_INBUF_EN |
                                             /* Normal mode */
                                             IOPCTL_PIO_SLEW_RATE_NORMAL |
                                             /* Full drive enable */
                                             IOPCTL_PIO_FULLDRIVE_EN |
                                             /* Analog mux is disabled */
                                             IOPCTL_PIO_ANAMUX_DI |
                                             /* Pseudo Output Drain is disabled */
                                             IOPCTL_PIO_PSEDRAIN_DI |
                                             /* Input function is not inverted */
                                             IOPCTL_PIO_INV_DI);
        /* PORT1 PIN29 (coords: U3) is configured as FLEXSPI0B_SCLK */
        IOPCTL_PinMuxSet(IOPCTL, 1U, 29U, port1_pin29_config);

        const uint32_t port2_pin12_config = (/* Pin is configured as PIO2_12 */
                                             IOPCTL_PIO_FUNC0 |
                                             /* Disable pull-up / pull-down function */
                                             IOPCTL_PIO_PUPD_DI |
                                             /* Enable pull-down function */
                                             IOPCTL_PIO_PULLDOWN_EN |
                                             /* Disable input buffer function */
                                             IOPCTL_PIO_INBUF_DI |
                                             /* Normal mode */
                                             IOPCTL_PIO_SLEW_RATE_NORMAL |
                                             /* Normal drive */
                                             IOPCTL_PIO_FULLDRIVE_DI |
                                             /* Analog mux is disabled */
                                             IOPCTL_PIO_ANAMUX_DI |
                                             /* Pseudo Output Drain is disabled */
                                             IOPCTL_PIO_PSEDRAIN_DI |
                                             /* Input function is not inverted */
                                             IOPCTL_PIO_INV_DI);
        /* PORT2 PIN12 (coords: T3) is configured as PIO2_12 */
        IOPCTL_PinMuxSet(IOPCTL, 2U, 12U, port2_pin12_config);

